app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE ("students"."first_name" IS NOT NULL)
---
  def index
    @students = Student.where.not(first_name: nil)